# 第02讲 Pandas读取数据

In [1]:
import pandas as pd

## 1. 读取纯文本文件

### 1.1 CSV（默认列名、分隔符）

In [2]:
ratings = pd.read_csv('./datas/movielens/ml-latest/ratings.csv')
ratings.head(5)

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

In [3]:
ratings.shape

(27753444, 4)

In [4]:
ratings.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [5]:
ratings.index

RangeIndex(start=0, stop=27753444, step=1)

In [6]:
ratings.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

### 1.2 TXT（自定义列名、分隔符）

In [7]:
pvuv = pd.read_csv(
    './datas/crazyant/access_pvuv.txt',
    sep='\t',
    header=None,
    names=['pdate', 'pv', 'uv']
)
pvuv.head(5)

        pdate   pv   uv
0  2019-09-10  139   92
1  2019-09-09  185  153
2  2019-09-08  123   59
3  2019-09-07   65   40
4  2019-09-06  157   98

## 2. 读取Excel文件

In [8]:
pvuv = pd.read_excel('./datas/crazyant/access_pvuv.xlsx')
pvuv.head(5)

        pdate   pv   uv
0  2019-09-10  139   92
1  2019-09-09  185  153
2  2019-09-08  123   59
3  2019-09-07   65   40
4  2019-09-06  157   98

## 3. 读取MySQL数据库

### 3.1 `read_sql`方法

In [9]:
import pymysql

In [10]:
conn = pymysql.connect(
    host='127.0.0.1',
    user='root',
    password='123456',
    database='crazyant',
    charset='utf8'
)

In [11]:
mysql_page = pd.read_sql('select * from access_pvuv', con=conn)
mysql_page.head(5)

        pdate   pv   uv
0  2019-09-01  105   61
1  2019-09-02  227  148
2  2019-09-03  216  176
3  2019-09-04  196  167
4  2019-09-05  205  151

### 3.2 `%sql`魔法命令

In [12]:
%load_ext sql
%sql mysql+pymysql://root:123456@localhost/crazyant

'Connected: root@crazyant'

In [13]:
data = %sql select * from access_pvuv

 * mysql+pymysql://root:***@localhost/crazyant
10 rows affected.

In [14]:
df = data.DataFrame()
df.head(5)

        pdate   pv   uv
0  2019-09-01  105   61
1  2019-09-02  227  148
2  2019-09-03  216  176
3  2019-09-04  196  167
4  2019-09-05  205  151